Hello -

I apologize for the slow reply here. Unfortunately I'm not able to reproduce the issue you've described. 
Here's the configuration file I used:

```hcl
provider "vault" {
  version = "v2.11.0"
}
resource "vault_mount" "test" {
  path        = "acctest-kv"
  type        = "kv"
  description = "This is an example mount"
  options = {
    "version" = "2"
  }
}

resource "vault_generic_secret" "test" {
  path      = "${vault_mount.test.path}/tester"
  data_json = <<EOT
{
    "zip": "kablamo"
}
EOT
}

data "vault_generic_secret" "test" {
  depends_on = [vault_generic_secret.test]
  path       = "${vault_generic_secret.test.path}"
  version    = 1
}
output vault_secret_rds_root_user {
  value     = vault_generic_secret.test
  sensitive = true
}
```


Here's the output from my attempt, using Terraform v0.12.25 and Vault Provider v2.11.0:

<details>

```shell
[terraform-provider-vault][master](4)$ terraform version                      
Terraform v0.12.25
+ provider.vault v2.11.0

Your version of Terraform is out of date! The latest version
is 0.13.4. You can update by downloading from https://www.terraform.io/downloads.html

[terraform-provider-vault][master](4)$ terraform plan                    
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

vault_mount.test: Refreshing state... [id=acctest-kv]
vault_generic_secret.test: Refreshing state... [id=acctest-kv/tester]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.vault_generic_secret.test will be read during apply
  # (config refers to values not yet known)
 <= data "vault_generic_secret" "test"  {
      + data             = (known after apply)
      + data_json        = (known after apply)
      + id               = (known after apply)
      + lease_duration   = (known after apply)
      + lease_id         = (known after apply)
      + lease_renewable  = (known after apply)
      + lease_start_time = (known after apply)
      + path             = "acctest-kv/tester"
      + version          = 1
    }

  # vault_generic_secret.test will be created
  + resource "vault_generic_secret" "test" {
      + data         = (sensitive value)
      + data_json    = (sensitive value)
      + disable_read = false
      + id           = (known after apply)
      + path         = "acctest-kv/tester"
    }

  # vault_mount.test will be created
  + resource "vault_mount" "test" {
      + accessor                  = (known after apply)
      + default_lease_ttl_seconds = (known after apply)
      + description               = "This is an example mount"
      + id                        = (known after apply)
      + max_lease_ttl_seconds     = (known after apply)
      + options                   = {
          + "version" = "2"
        }
      + path                      = "acctest-kv"
      + seal_wrap                 = (known after apply)
      + type                      = "kv"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

[terraform-provider-vault][master](4)$ terraform apply -auto-approve         
vault_mount.test: Refreshing state... [id=acctest-kv]
vault_generic_secret.test: Refreshing state... [id=acctest-kv/tester]
vault_mount.test: Creating...
vault_mount.test: Creation complete after 0s [id=acctest-kv]
vault_generic_secret.test: Creating...
vault_generic_secret.test: Creation complete after 0s [id=acctest-kv/tester]
data.vault_generic_secret.test: Refreshing state...

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

Outputs:

vault_secret_rds_root_user = <sensitive>

[terraform-provider-vault][master](4)$ terraform output      
vault_secret_rds_root_user = <sensitive>
```

</details>

I'm not sure what the cause could be here, but I'll also say that I _believe_ the feature/functionality of the `output` directive wouldn't be dictated by anything specified in the provider or resources, and this issue may have been incorrectly routed to this GitHub project. 

If you can share more information or another example that reproduces this issue, I'd be happy to assist further. Thanks!